app/Controllers/Mantenimiento/Categorias.php

SELECT *
FROM `categorias`
WHERE `estado` = 1
---
	public function index(){

		//$this->session = parent::$this->session;

		$language = \Config\Services::language();
        //d($language->setLocale($this->session->lang));
		$supported = [
			'en',
			'es',
			'pt-BR',
		];
//d($lang = $this->request->negotiate('language', $supported));
		if($this->permisos==null){
			return redirect('login');
		}
		else
		{
		// Arma el Array para pasar a la vista
			$model	= new CategoriasModel();
			$categorias = (array) $model->where('estado',1)->findAll();