app/Controllers/Mantenimiento/Clientes.php

SELECT *
FROM `clientes`
WHERE `estado` = 1
---
	public function index(){
		//dd($this->permisos); hacer el insert del menu y rol con los permisos.
		//d($this->permisos);
		$model	= new ClientesModel();
		$clientes = (array) $model->where('estado',1)->findAll();