app/Controllers/Mantenimiento/Productos.php

		public function index(){
			$productos = new ProductosModel();
			$data['productos'] = $productos->findAll();
---
SELECT *
FROM `productos`