app/Models/BackendModel.php

	public function getID($link){
		$db = \Config\Database::connect();
		$builder = $db->table('menus');
		$resultado = $builder->like('link',$link)->get()->getRow();
---
SELECT *
FROM `menus`
WHERE `link` LIKE '%mant/categorias%' ESCAPE '!'